# 1. 基本数据类型（int float bool complex）
# 2. 运算（+ - * / ** // % math模块）
# 3. 运算符（算术运算符 赋值运算符 比较运算符 逻辑运算符 位运算符 成员运算符）
#     算术运算符 + - * / ** // %
#     赋值运算符 = += -= *= /= **= //= %=
#     比较运算符 == != > < >= <=
#     逻辑运算符 and or not
#     位运算符   & | ~
#     成员运算符 in/not in
#          优先级
#            高   **                            指数
#                 ~                             按位取反
#                 * / % //                      四则运算
#                 + -                           四则运算
#                 &                             位运算符
#                 <= >= > <                     比较运算符
#                 == !=                         等于运算符
#                 = %= 、= 、、= -= += **=       赋值运算符
#                 is/is not                     身份运算符
#                 in/not in                     成员运算符
#            低   not or and                    逻辑运算符
# 4. 几类字符串
#     "北京市"
#     b'\xb1\xb1\xbe\xa9\xca\xd0'
#     u'\u5317\u4eac\u5e02'
#     r"\n"
# 5. 可迭代对象 iterable
# 6. range()（等价于 [start,stop) ）
